testing/load/jmeter/sqrt-app/latest_report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 71067,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 635.6213291682495,
    "medianResTime" : 608.0,
    "minResTime" : 40.0,
    "maxResTime" : 17229.0,
    "pct1ResTime" : 1294.0,
    "pct2ResTime" : 1891.0,
    "pct3ResTime" : 5757.0,
    "throughput" : 118.29319040564609,
    "receivedKBytesPerSec" : 4261.722500070223,
    "sentKBytesPerSec" : 13.631441863150624
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 71067,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 635.6213291682495,
    "medianResTime" : 608.0,
    "minResTime" : 40.0,
    "maxResTime" : 17229.0,
    "pct1ResTime" : 1294.0,
    "pct2ResTime" : 1891.0,
    "pct3ResTime" : 5757.0,
    "throughput" : 118.29319040564609,
    "receivedKBytesPerSec" : 4261.722500070223,
    "sentKBytesPerSec" : 13.631441863150624
  }
}